var  Article3=`&emsp;&emsp;前端，提到这个大多数人都会想到，不就是一堆div标签拼凑起来的页面么，有什么技术含量？  

<p>&emsp;&emsp;但是事实真的是这样么？在我没有接触前端之前，一直听别人说前端，他们一说起前端，就给人一种前端特别容易学，
只要掌握了div就掌握了所有东西的感觉，或许越是不懂的人越容易发表这样的言论吧！</p>

<p>&emsp;&emsp;我第一次接触前端是看到一个朋友在写前端代码，我亲眼看着她用一行行小小的代码实现了一个又一个的功能，
当时真的很震惊，以前总是浏览着别人写的网站，现在居然能亲眼看见一个网站的实现过程，欣喜之情溢于言表！
之后一直对这个神奇的东西抱着一个神圣而又不可侵犯的态度。</p>

<p>&emsp;&emsp;开始学前端是在大三上学期，先从html,然后css，javaScript,Jquery等等这样按部就班的一个一个的来。
学完这些之后就开始找一些小的例子练习，之后再学习框架。轻描淡写的几句话，似乎把前端的路说的那么容易，
走的那么轻松，但是事实上，中途遇到的困难真的很多很多，刚开始的时候甚至会因为一个居中，一个对齐而不停的调试代码，
也会因为一个组件的摆放位置而不停的思考，也会因为一行js代码的不停报错而反反复复的折腾好久。虽然说这条路上有些时候是比较的辛酸，
但是到最后当我把一个完整的页面都写好，看到自己的成果被别人称赞时，忽然发现自己之前的那些辛苦是那么的值得。</p>
<p>
 &emsp;&emsp;从学前端到现在大约有7,8个月的时间了吧，我不敢说我学的有多好，毕竟大学里面，除了大一大二老老实实去上每一节课，
 大三我做的最有意义的一件事情就是学习了这个我曾经认为很神圣的东西，即使我并没有学的特别的出色，但是至少我为此付出过努力，
 从一开始的什么都不懂，到现在能够写出一些小的项目，搭建起github,写出自己博客，至少我自己感觉我是成功的。接下来，我即将踏上我的找工作之路，
 但愿我的努力可以获得别人认可的成功，加油吧！
</p>
<p>&emsp;&emsp;前端，我注定要一直走下去。。。。</p>
`;